# PoundsForcePerFoot Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..PoundsForcePerFoot Property
UnitTypeId Class See Also
---
Pounds force per foot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId PoundsForcePerFoot { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PoundsForcePerFoot As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PoundsForcePerFoot {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace